accscms-test/TempXML/CMS/abil.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:man="http://accscms.tti.com/schemas/ManifestDefinition" xmlns:bas="http://accscms.tti.com/schemas/BaseDefinition" xmlns:man1="http://accscms.tti.com/schemas/Manifest">
   <soapenv:Header/>
   <soapenv:Body>
      <man:SetAirWaybillRequest>
         <bas:messageContext>
            <bas:usernameToken>
               <bas:username>?</bas:username>
               <bas:passwordDigest>?</bas:passwordDigest>
               <bas:nonce>?</bas:nonce>
               <bas:created>?</bas:created>
            </bas:usernameToken>
            <!--Optional:-->
            <bas:offset>?</bas:offset>
            <!--Optional:-->
            <bas:numOfResult>?</bas:numOfResult>
         </bas:messageContext>
         <man:messageDetail>
            <man:airWaybill>
               <man1:airWaybillControl>
                  <man1:referenceNumber>?</man1:referenceNumber>
                  <man1:receivedControlNumber>?</man1:receivedControlNumber>
                  <man1:freightForwarderTaxNumber>?</man1:freightForwarderTaxNumber>
                  <man1:freightForwarderBranch>?</man1:freightForwarderBranch>
                  <man1:processingIndicator>?</man1:processingIndicator>
                  <man1:masterAirWaybill>?</man1:masterAirWaybill>
                  <man1:isoOriginCountryCode>?</man1:isoOriginCountryCode>
                  <man1:portOfLoading>?</man1:portOfLoading>
                  <man1:portOfDischarge>?</man1:portOfDischarge>
                  <man1:placeOfDelivery>?</man1:placeOfDelivery>
                  <man1:shedNumber>?</man1:shedNumber>
                  <man1:messageFunction>?</man1:messageFunction>
                  <man1:editUserID>?</man1:editUserID>
               </man1:airWaybillControl>
               <!--1 to 99999 repetitions:-->
               <man1:airWaybillDetail>
                  <man1:referenceNo>?</man1:referenceNo>
                  <man1:houseAirWaybill>?</man1:houseAirWaybill>
                  <man1:consignor>
                     <man1:streetAndNumber>?</man1:streetAndNumber>
                     <man1:district>?</man1:district>
                     <man1:subProvince>?</man1:subProvince>
                     <man1:province>?</man1:province>
                     <man1:postcode>?</man1:postcode>
                     <man1:phoneNumber>?</man1:phoneNumber>
                     <man1:isoCountryCode>?</man1:isoCountryCode>
                     <man1:consignorName>?</man1:consignorName>
                  </man1:consignor>
                  <man1:consigneeOrNotifyParty>?</man1:consigneeOrNotifyParty>
                  <man1:consignee>
                     <man1:streetAndNumber>?</man1:streetAndNumber>
                     <man1:district>?</man1:district>
                     <man1:subProvince>?</man1:subProvince>
                     <man1:province>?</man1:province>
                     <man1:postcode>?</man1:postcode>
                     <man1:phoneNumber>?</man1:phoneNumber>
                     <man1:isoCountryCode>?</man1:isoCountryCode>
                     <man1:consigneeName>?</man1:consigneeName>
                  </man1:consignee>
                  <man1:notifyParty>
                     <man1:streetAndNumber>?</man1:streetAndNumber>
                     <man1:district>?</man1:district>
                     <man1:subProvince>?</man1:subProvince>
                     <man1:province>?</man1:province>
                     <man1:postcode>?</man1:postcode>
                     <man1:phoneNumber>?</man1:phoneNumber>
                     <man1:isoCountryCode>?</man1:isoCountryCode>
                     <man1:notifyPartyName>?</man1:notifyPartyName>
                  </man1:notifyParty>
                  <man1:grossWeight>?</man1:grossWeight>
                  <man1:grossWeightUnit>?</man1:grossWeightUnit>
                  <man1:numberOfPackage>?</man1:numberOfPackage>
                  <man1:packageUnit>?</man1:packageUnit>
                  <man1:fobValue>?</man1:fobValue>
                  <man1:fobCurrencyCode>?</man1:fobCurrencyCode>
                  <man1:freightValue>?</man1:freightValue>
                  <man1:freightCurrencyCode>?</man1:freightCurrencyCode>
                  <man1:insuranceValue>?</man1:insuranceValue>
                  <man1:insuranceCurrencyCode>?</man1:insuranceCurrencyCode>
                  <man1:dangerousGoods>?</man1:dangerousGoods>
                  <man1:markAndLabels>?</man1:markAndLabels>
                  <man1:descriptionOfGoods>?</man1:descriptionOfGoods>
                  <man1:declarationNo>?</man1:declarationNo>
                  <man1:lastEntry>?</man1:lastEntry>
                  <man1:balanced>?</man1:balanced>
                  <man1:balancedDate>?</man1:balancedDate>
               </man1:airWaybillDetail>
            </man:airWaybill>
         </man:messageDetail>
      </man:SetAirWaybillRequest>
   </soapenv:Body>
</soapenv:Envelope>